swak4Foam/Examples/groovyBC/average-t-junction/constant/polyMesh/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           outlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |inlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           outlet2

convertToMeters 1;

vertices
(
    (0.0  -0.01 0)   //0
    (0.2  -0.01 0)
    (0.2   0.01 0)   //2
    (0.0   0.01 0)

    (0.24 -0.01 0)  //4
    (0.24  0.01 0)

    (0.2  -0.21 0)  //6
    (0.24 -0.21 0)

    (0.2   0.21 0)  //8
    (0.24  0.21 0)

    // Z
    (0.0  -0.01 0.02)   //0
    (0.2  -0.01 0.02)
    (0.2   0.01 0.02)   //2
    (0.0   0.01 0.02)

    (0.24 -0.01 0.02)  //4
    (0.24  0.01 0.02)

    (0.2  -0.21 0.02)  //6
    (0.24 -0.21 0.02)

    (0.2   0.21 0.02)  //8
    (0.24  0.21 0.02)

    (0.18   -0.01    0)
    (0.18    0.01    0)
    (0.18   -0.01    0.02)
    (0.18    0.01    0.02)

    (0.18  -0.21 0)
    (0.18  -0.21 0.02)
);

blocks
(
    // inlet block
    hex (0 20 21 3  10 22 23 13) (50 5 5) simpleGrading (1 1 1)

    // central block
    hex (1 4 5 2  11 14 15 12) (10 5 5) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (10 50 5) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (10 50 5) simpleGrading (1 1 1)

    // inlet 2
    hex (20 1 2 21 22 11 12 23) (5 5 5) simpleGrading (1 1 1)

    // bottom block 2
    hex (24 6 1 20 25 16 11 22) (5 50 5) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 10 13 3)
    )

    patch outlet1
    (
        (6 7 17 16)
        (24 6 16 25)
    )

    patch outlet2
    (
        (8 18 19 9)
    )
    wall defaultFaces 
    (
	(13 23 22 10)
	(0 3  21 20)
	(20 21 2 1)
	(20 1 6 24)
	(6 1 4 7)
	(1 2 5 4)
	(5 2 8 9)
	(15 12 18 19)
	(11 12 15 14)
	(22 23 12 11)
	(11 14 17 16)
	(22 11 16 25)
	(0 10 22 20)
	(3 13 23 21)
	(20 22 25 24)
	(4 14 17 7)
	(14 15 5 4)
	(15 19 9 5)
	(12 23 21 2)
	(8 18 12 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
